```
krishna@turbotindias-MacBook-Pro aws_check_cost_controls % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher

turbot_smart_folder.aws_cost_controls: Refreshing state... [id=215478446218537]
turbot_policy_setting.aws_ec2_instance_schedule_tag: Refreshing state... [id=215478451926392]
turbot_policy_setting.aws_ec2_volume_active_attached: Refreshing state... [id=215478449613120]
turbot_policy_setting.set_resource_active_policies["aws-lambda-function"]: Refreshing state... [id=215478449611070]
turbot_policy_setting.ec2_instance_schedule: Refreshing state... [id=215478449864025]
turbot_policy_setting.aws_ec2_volume_active: Refreshing state... [id=215478449889640]
turbot_policy_setting.set_resource_active_policies["aws-ec2-snapshot"]: Refreshing state... [id=215478449864024]
turbot_policy_setting.set_resource_active_policies["aws-ec2-instance"]: Refreshing state... [id=215478451338611]
turbot_policy_setting.set_resource_age_policies["aws-ec2-instance"]: Refreshing state... [id=215478451319151]
turbot_policy_setting.set_resource_active_policies["aws-s3-bucket"]: Refreshing state... [id=215478449866074]
turbot_policy_setting.set_resource_age_policies["aws-ec2-ami"]: Refreshing state... [id=215478449619269]
turbot_policy_setting.set_resource_age_policies["aws-ec2-snapshot"]: Refreshing state... [id=215478451962237]
turbot_policy_setting.set_resource_age_policies["aws-lambda-function"]: Refreshing state... [id=215478449620294]
turbot_policy_setting.set_resource_age_policies["aws-s3-bucket"]: Refreshing state... [id=215478449624394]
turbot_policy_setting.set_resource_active_policies["aws-ec2-ami"]: Refreshing state... [id=215478449864023]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_ec2_instance_schedule_tag will be created
  + resource "turbot_policy_setting" "aws_ec2_instance_schedule_tag" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceScheduleTag"
      + value                        = "Skip"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_volume_active will be created
  + resource "turbot_policy_setting" "aws_ec2_volume_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/volumeActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_volume_active_attached will be created
  + resource "turbot_policy_setting" "aws_ec2_volume_active_attached" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/volumeActiveAttached"
      + value                        = "Force inactive if unattached"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.ec2_instance_schedule will be created
  + resource "turbot_policy_setting" "ec2_instance_schedule" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceSchedule"
      + value                        = "Skip"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["aws-ec2-ami"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/amiActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["aws-ec2-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["aws-ec2-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/snapshotActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["aws-lambda-function"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["aws-s3-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/bucketActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["aws-ec2-ami"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/amiActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["aws-ec2-instance"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["aws-ec2-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/snapshotActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["aws-lambda-function"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["aws-s3-bucket"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/bucketActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_cost_controls will be created
  + resource "turbot_smart_folder" "aws_cost_controls" {
      + description = "Defines sets of policies for the AWS check regions baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check Cost Control Policies"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_cost_controls: Creating...
turbot_smart_folder.aws_cost_controls: Creation complete after 1s [id=215478767823323]
turbot_policy_setting.aws_ec2_volume_active_attached: Creating...
turbot_policy_setting.set_resource_age_policies["aws-ec2-instance"]: Creating...
turbot_policy_setting.set_resource_age_policies["aws-lambda-function"]: Creating...
turbot_policy_setting.set_resource_active_policies["aws-ec2-snapshot"]: Creating...
turbot_policy_setting.ec2_instance_schedule: Creating...
turbot_policy_setting.set_resource_age_policies["aws-s3-bucket"]: Creating...
turbot_policy_setting.set_resource_active_policies["aws-lambda-function"]: Creating...
turbot_policy_setting.set_resource_active_policies["aws-ec2-ami"]: Creating...
turbot_policy_setting.set_resource_active_policies["aws-s3-bucket"]: Creating...
turbot_policy_setting.aws_ec2_instance_schedule_tag: Creating...
turbot_policy_setting.set_resource_active_policies["aws-lambda-function"]: Creation complete after 3s [id=215478771523046]
turbot_policy_setting.set_resource_age_policies["aws-s3-bucket"]: Creation complete after 3s [id=215478771536364]
turbot_policy_setting.set_resource_age_policies["aws-ec2-snapshot"]: Creating...
turbot_policy_setting.aws_ec2_volume_active: Creating...
turbot_policy_setting.set_resource_active_policies["aws-ec2-ami"]: Creation complete after 3s [id=215478771532265]
turbot_policy_setting.aws_ec2_instance_schedule_tag: Creation complete after 3s [id=215478771557878]
turbot_policy_setting.ec2_instance_schedule: Creation complete after 3s [id=215478771541486]
turbot_policy_setting.set_resource_age_policies["aws-ec2-ami"]: Creating...
turbot_policy_setting.set_resource_active_policies["aws-ec2-instance"]: Creating...
turbot_policy_setting.set_resource_age_policies["aws-lambda-function"]: Creation complete after 4s [id=215478772280844]
turbot_policy_setting.set_resource_active_policies["aws-s3-bucket"]: Creation complete after 4s [id=215478772268546]
turbot_policy_setting.set_resource_age_policies["aws-ec2-instance"]: Creation complete after 5s [id=215478772310546]
turbot_policy_setting.aws_ec2_volume_active_attached: Creation complete after 5s [id=215478772273669]
turbot_policy_setting.set_resource_active_policies["aws-ec2-snapshot"]: Creation complete after 5s [id=215478772273668]
turbot_policy_setting.set_resource_age_policies["aws-ec2-ami"]: Creation complete after 1s [id=215478773738021]
turbot_policy_setting.set_resource_age_policies["aws-ec2-snapshot"]: Creation complete after 2s [id=215478773233181]
turbot_policy_setting.aws_ec2_volume_active: Creation complete after 3s [id=215478774114858]
turbot_policy_setting.set_resource_active_policies["aws-ec2-instance"]: Creation complete after 2s [id=215478774842927]

Apply complete! Resources: 15 added, 0 changed, 0 destroyed.

Outputs:

resource_active = {
  "aws-ec2-ami" = "Check: Active"
  "aws-ec2-instance" = "Check: Active"
  "aws-ec2-snapshot" = "Check: Active"
  "aws-lambda-function" = "Check: Active"
  "aws-s3-bucket" = "Check: Active"
}
smart_folder_description = Defines sets of policies for the AWS check regions baseline
smart_folder_name = AWS Check Cost Control Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher
